results/mpi_benchmark/sysbench_fio/fio_cephfs/oc_sys-fio_cephfs.worker05_1threads.1/stdout
sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     526.63
    fsyncs/s:                     682.83

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               8.23

General statistics:
    total time:                          10.0627s
    total number of events:              12044

Latency (ms):
         min:                                    0.00
         avg:                                    0.83
         max:                                    6.22
         95th percentile:                        2.97
         sum:                                 9992.51

Threads fairness:
    events (avg/stddev):           12044.0000/0.00
    execution time (avg/stddev):   9.9925/0.00

sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      1226.53
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  19.16
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0008s
    total number of events:              12268

Latency (ms):
         min:                                    0.00
         avg:                                    0.81
         max:                                   16.16
         95th percentile:                        1.21
         sum:                                 9982.73

Threads fairness:
    events (avg/stddev):           12268.0000/0.00
    execution time (avg/stddev):   9.9827/0.00

DONE